<a href="https://colab.research.google.com/github/VAEH/curso-python/blob/master/3_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
pd.__version__

'1.2.4'

In [ ]:
dict_data={'co':300, 'MX':400, 'CH':200}
dict_data

{'CH': 200, 'MX': 400, 'co': 300}

In [ ]:
pd.Series(dict_data)

co    300
MX    400
CH    200
dtype: int64

In [ ]:
#Usamos un diccionario diferente que contendra una lista de elementos
dict_data = {'CH':[100,800,200], 'CO':[100,200,300], 'MX': [300,500,400]}
dict_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

In [ ]:
#Convertimos el diccionario en un DATAFRAME
df = pd.DataFrame(dict_data)
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

In [ ]:
#para analisis númerico
import numpy as np

In [ ]:
#Diccionario sobre información de estudiantes 
dict_data = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9.0],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [ ]:
#transformamos el diccionario anterior en un DataFrame
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [ ]:
#Para ver las propiedas de las variables 
df.index

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

In [ ]:
#Si queremos obtener los valores de las columnas
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [ ]:
#Valores internos
df.values

array([[10, 115, 'co', 'M', 5.0, 7.0],
       [9, 110, 'mx', 'F', 10.0, 9.0],
       [13, 130, 'co', 'F', 8.0, 9.0],
       [14, 155, 'mx', 'M', nan, 8.0],
       [12, 125, 'mx', 'M', 7.0, 8.0],
       [11, 120, 'ch', 'M', 8.0, 8.0],
       [12, 125, 'ch', 'F', 3.0, 9.0]], dtype=object)

In [ ]:
#Queremos saber la edad de los estudiantes
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [ ]:
#Queremos la edad, altura y el grado
df[['edad', 'cm', 'Q1']]

          edad   cm    Q1
ana         10  115   5.0
benito       9  110  10.0
camilo      13  130   8.0
daniel      14  155   NaN
erika       12  125   7.0
fabian      11  120   8.0
gabriela    12  125   3.0

In [ ]:
#Si queremos seleccionar la edad de dos estudiantes
#Utilizamos la función "loc" que nos permite lozalizarlos exactamente 
#Obtenemos una serie con los datos de Ana
df.loc['ana',['edad', 'cm', 'Q1'] ]

edad     10
cm      115
Q1      5.0
Name: ana, dtype: object

In [ ]:
df.loc[['ana', 'erika'],['edad', 'cm', 'Q1'] ]

       edad   cm   Q1
ana      10  115  5.0
erika    12  125  7.0

In [ ]:
df.loc['daniel','Q1']

nan

In [ ]:
df

          edad   cm pais genero    Q1   Q2
ana         10  115   co      M   5.0  7.0
benito       9  110   mx      F  10.0  9.0
camilo      13  130   co      F   8.0  9.0
daniel      14  155   mx      M   NaN  8.0
erika       12  125   mx      M   7.0  8.0
fabian      11  120   ch      M   8.0  8.0
gabriela    12  125   ch      F   3.0  9.0

In [ ]:
#Podemos usar la posición
#la funcipon "loc" me permite seleccionar datos a través de sus indices y columnas 
#"iloc" nos lo permite a traves de su posición dentro del DataFrame 
df.iloc[2,1]

130

In [ ]:
#En "iloc" se puede seleccionar varios subconjuntos de elementos 
df.iloc[2,[1,3]]

cm        130
genero      F
Name: camilo, dtype: object

In [ ]:
#También podemos colocar listas de varios elementos 
df.iloc[[2,4,5],[1,3]]
#También podemos utilizar el rebanado de datos
#Esto permite traer  todos los indixes, pero la informaciónde ciertas columnas como: CM y genero
df.iloc[:,[1,3]]

           cm genero
ana       115      M
benito    110      F
camilo    130      F
daniel    155      M
erika     125      M
fabian    120      M
gabriela  125      F

In [ ]:
#Podemos usar otros filtros basados en condiciones
df['edad']>=12
#Al ejecutar, obtenemos un binario

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [ ]:
#Lo podemos agregar a otro df para ver mejor los datos
df[df['edad']>=12]

          edad   cm pais genero   Q1   Q2
camilo      13  130   co      F  8.0  9.0
daniel      14  155   mx      M  NaN  8.0
erika       12  125   mx      M  7.0  8.0
gabriela    12  125   ch      F  3.0  9.0

In [ ]:
#Se pueden tener varias condiciones al mismo tiempo
df[(df['edad']>=12) & (df['pais']=='mx')]
#Imprimer los estudiantes que son mayores a 12 años y el país

        edad   cm pais genero   Q1   Q2
daniel    14  155   mx      M  NaN  8.0
erika     12  125   mx      M  7.0  8.0

In [ ]:
#Otra forma es con la función "Query"
df.query('edad >12')

        edad   cm pais genero   Q1   Q2
camilo    13  130   co      F  8.0  9.0
daniel    14  155   mx      M  NaN  8.0

In [ ]:
#Queremos tener los datos de los estudiantes que tuvieron una mejor nota 
df[df['Q2'] >=df['Q1']]
#Con esto obtenemos los datos que tvieron una mejor nota o que mantuvieron

          edad   cm pais genero   Q1   Q2
ana         10  115   co      M  5.0  7.0
camilo      13  130   co      F  8.0  9.0
erika       12  125   mx      M  7.0  8.0
fabian      11  120   ch      M  8.0  8.0
gabriela    12  125   ch      F  3.0  9.0